Revit 2027 API
PropertyTableEntry.Radius Property
 The radius for arc type curve The radius value must be greater than half the length of the line segment. The larger the radius, the larger the circle becomes, resulting in a flatter arc.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Radius { get; }
Public ReadOnly Property Radius As Double
	Get
public:
property double Radius {
	double get ();
}
member Radius : float with get
Property Value
Double
See Also
Reference
PropertyTableEntry Class
Autodesk.Revit.DB Namespace